Extensions/src/Documents/ЧекККМ/ЧекККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЧекККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресЭП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЭквайринговыйТерминал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерЧекаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПолученоНаличными</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>AzRyАналитикаКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>AzRyЭлектроннаяНакладная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаОплатыПлатежнымиКартами</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НоммерОчереди</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Консультант</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроцентСкидкиПоДисконтнойКарте</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Архивный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НДСВключатьВСтоимость</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидСкидкиНаценки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДисконтнаяКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкидкиРассчитаны</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>СкидкиНаценки</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections>
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПроцентАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Всего</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Консультант</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОплатаПлатежнымиКартами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СсылочныйНомер</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерЧекаЭТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВидПлатежнойКарты</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерПлатежнойКарты</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>24</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

Extensions/src/Documents/ЧекККМ/Forms/ФормаОплаты/Module.bsl
&НаСервере
Процедура РасшAzRy_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	
	ТекЗначение = ДанныеФормыВЗначение(Параметры.Объект, Тип("ДокументОбъект.ЧекККМ"));
	ЗначениеВРеквизитФормы(ТекЗначение, "Объект"); // Получим данные документа.
	
	СуммаДокумента = Параметры.СуммаДокумента;
	ВалютаДокумента = Параметры.ВалютаДокумента;
	КассаККМ = Параметры.КассаККМ;
	ИспользоватьПодключаемоеОборудование = Параметры.ИспользоватьПодключаемоеОборудование;
	Объект.ЭквайринговыйТерминал = Параметры.ЭквайринговыйТерминал;
	//Паганини_
	пЭквайринговыйТерминал = Объект.ЭквайринговыйТерминал;
	Если пЭквайринговыйТерминал.ВидыПлатежныхКарт.Количество()> 0 Тогда
		пВидПлатежнойКарты		= пЭквайринговыйТерминал.ВидыПлатежныхКарт[0].ВидПлатежнойКарты;
		пНомерПлатежнойКарты	= пЭквайринговыйТерминал.Код;
	КонецЕсли;
	СформироватьТоварныйЧек = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ЗначениеПечатьЧека");
	//_Паганини
	ЭквайринговыйТерминалПриИзмененииНаСервере();
	
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	Если ИспользоватьПодключаемоеОборудование Тогда
		ПолучитьСсылкиНаОборудование();
	КонецЕсли;
	
	// +++ { AzRy - [26.05.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:
	//КонтрольНаСкладеОтключен = НЕ Константы.КонтролироватьОстаткиПриПроведении.Получить()
	КонтрольНаСкладеОтключен = НЕ УправлениеНебольшойФирмойСервер.ВыполнитьКонтрольОстатков()
	// +++ } AzRy - [26.05.2022] - Jira:ERPM-886 - Developer:ადმინისტრატორი (administrator@azry.com) - Comment:	
						   ИЛИ НЕ Константы.КонтролироватьОстаткиПриПробитииЧековККМ.Получить();
	
	КассаККМИспользоватьБезПодключенияОборудования = КассаККМ.ИспользоватьБезПодключенияОборудования;
	
	Элементы.ГруппаШаблонКартыОплаты.Видимость = Ложь;
	
	// Обработка карт.
	КоличествоКартВДокументе = Параметры.ОплатаПлатежнымиКартами.Количество();
	Если КоличествоКартВДокументе = 0 И Не ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда
		Элементы.ГруппаКалькуляторИНомерКарты.Доступность = Истина;
		ДобавитьКартуНаСервере();
		КоличествоКартДляЗаголовка = 0;
	Иначе
		Элементы.ГруппаКалькуляторИНомерКарты.Доступность = Ложь;
		Если КоличествоКартВДокументе = 0 Тогда
			Элементы.НадписьТекущееПолеВвода.Видимость = Ложь;
		Иначе
			Для каждого СтрокаОплатыКартой Из Объект.ОплатаПлатежнымиКартами Цикл
				НоваяСтрока = ВременнаяТаблицаКарт.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОплатыКартой);
				ДобавитьКартуНаСервере(НоваяСтрока);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	ОсталосьОплатить = СуммаДокумента - ВременнаяТаблицаКарт.Итог("Сумма");
	Элементы.ПолученоНаличными.СписокВыбора.Очистить();
	Элементы.ПолученоНаличными.СписокВыбора.Добавить(ОсталосьОплатить, ""+ОсталосьОплатить+" "+ВалютаДокумента);
	КоличествоСимволовПослеЗапятой = 2;
	ПервыйВвод = Истина;
	
	// Установка сочетания клавиш
	Для Сч = 0 По 9 Цикл
		Элементы["Кнопка"+Сч].СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша["Num"+Сч], Ложь, Истина, Ложь);
	КонецЦикла;
	Элементы.РазделительДробнойЧасти.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.NumDecimal, Ложь, Истина, Ложь);
	Элементы.Сбросить.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.BackSpace, Ложь, Истина, Ложь);
	
	//+++ Дмгг
	Для Сч = 0 По 9 Цикл
		Элементы["Кнопка"+Сч+"_3"].СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша["Num"+Сч], Ложь, Истина, Ложь);
	КонецЦикла;
	Элементы.РазделительДробнойЧасти_3.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.NumDecimal, Ложь, Истина, Ложь);
	Элементы.Сбросить_3.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.BackSpace, Ложь, Истина, Ложь);
	
	Для Сч = 0 По 9 Цикл
		Элементы["Кнопка"+Сч+"_4"].СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша["Num"+Сч], Ложь, Истина, Ложь);
	КонецЦикла;
	Элементы.РазделительДробнойЧасти_3.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.NumDecimal, Ложь, Истина, Ложь);
	Элементы.Сбросить_3.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша.BackSpace, Ложь, Истина, Ложь);
	//--- Дмгг 
	
	Элементы.ГруппаКартыОплаты.Доступность = ЗначениеЗаполнено(Объект.ЭквайринговыйТерминал);
	
	// Блокировка.
	Если Не Объект.Ссылка.Пустая() И Параметры.Свойство("ИдентификаторФормы") Тогда
		Попытка
			РазблокироватьДанныеДляРедактирования(Объект.Ссылка, Параметры.ИдентификаторФормы);
			ЗаблокироватьДанныеДляРедактирования(Объект.Ссылка, , УникальныйИдентификатор); // Блокировка будет снята при закрытии формы.
		Исключение
			//
		КонецПопытки;
	КонецЕсли;
	
	УстановитьВидимостьОтправкиЭлектронныхЧеков();
	
	// Автоматические скидки.
	Если ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиНаценки") Тогда
		Если Объект.СкидкиРассчитаны И Параметры.СуммаДоРасчетаАвтоСкидок <> Объект.Запасы.Итог("Всего") Тогда
			Элементы.НадписьАвтоСкидкиРассчитаны.Заголовок = НСтр("ka='(автоскидки рассчитаны)';ru='(автоскидки рассчитаны)';en='(Avtoskidki calculated)'");
		Иначе
			Элементы.НадписьАвтоСкидкиРассчитаны.Заголовок = "";
		КонецЕсли;
	Иначе
		Элементы.НадписьАвтоСкидкиРассчитаны.Заголовок = "";
	КонецЕсли;
	
	//+++ Дмгг
	ДоступностьСмешаннойОплаты = ПолучитьФункциональнуюОпцию("НерегулярнаяОплатаВРознице");
	
	УстановитьВидимостьСмешаннойОплаты();
	Если ДоступностьСмешаннойОплаты Тогда 
		Если Элементы.ГруппаОплата.ТекущаяСтраница.Имя = "ГруппаНаличнаяОплата" Тогда 
			Если Параметры.Свойство("СуммаДокумента") Тогда 
				ПолученоНаличными = Параметры.СуммаДокумента;
			КонецЕсли;
		ИначеЕсли Элементы.ГруппаОплата.ТекущаяСтраница.Имя = "ГруппаБезналичнаяОплата" Тогда
			Если Параметры.Свойство("СуммаДокумента") Тогда
				ВременнаяТаблицаКарт[0].Сумма = Параметры.СуммаДокумента;
			КонецЕсли;
		ИначеЕсли Элементы.ГруппаОплата.ТекущаяСтраница.Имя = "ГруппаСмешаннаяОплата" Тогда
			Если Параметры.Свойство("СуммаДокумента") Тогда
				ПолученоНаличными = 0;
				ВременнаяТаблицаКарт[0].Сумма = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// НоваяФормаОплаты
	Если Параметры.Свойство("ИспользоватьНовуюФормуОплат") Тогда 
		ИспользоватьНовуюФормуОплат = Параметры.ИспользоватьНовуюФормуОплат;
		ТаблицаКнопокТерминалов.Очистить();
		Если Параметры.ИспользоватьНовуюФормуОплат Тогда 
			Если Параметры.Свойство("ДоступныеТерминалы") Тогда 
				Сч = 1;
				Для Каждого Элем Из Параметры.ДоступныеТерминалы Цикл 
					
					//Добавляем новую команду
					Кмд = ЭтаФорма.Команды.Добавить("КомандаТерминал" + Сч);
					Кмд.Действие = "НажатиеКнопкиКомандаТерминал";// + Сч;
					Кмд.Заголовок = Элем.Наименование;
					
					//Добавляем новую кнопку
					Элемент2 = ЭтаФорма.Элементы.Добавить("КомандаТерминал" + Сч, Тип("КнопкаФормы"), ЭтаФорма.Элементы.ГруппаКнопок);
					Элемент2.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
					Элемент2.ИмяКоманды = "КомандаТерминал" + Сч;
					Элемент2.Ширина = 30;
					Элемент2.Высота = 2;
					
					СтрокаКонопокТерминалов = ТаблицаКнопокТерминалов.Добавить();
					СтрокаКонопокТерминалов.ИмяКнопки = "КомандаТерминал" + Сч;
					СтрокаКонопокТерминалов.ЭквайринговыйТерминал = Элем;
					Сч = Сч + 1;
				КонецЦикла;
			КонецЕсли;
			
			
		КонецЕсли;
		УстановитьВидимостьПриновойФормеОплат();
	КонецЕсли;
	//--- Дмгг
	
КонецПроцедуры
